
### :robot: Terraform Report
---
##### Plan: `1` to add, `0` to change, `0` to destroy

<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # helm_release.argocd_app_kiali[0] will be created
  + resource "helm_release" "argocd_app_kiali" {
      + atomic                     = false
      + chart                      = "argocd-apps"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "argocd-app-kiali"
      + namespace                  = "argocd"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://argoproj.github.io/argo-helm"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                applications:
                  kiali:
                    namespace: argocd
                    project: kiali
                
                    sources:
                    - chart: kiali-server
                      repoURL: https://kiali.org/helm-charts
                      targetRevision: 1.89.4
                      parameters:
                        - name: auth.strategy
                          value: "anonymous"
                
                    destination:
                      server: https://kubernetes.default.svc
                      namespace: istio-system
                
                    syncPolicy:
                      automated:
                        prune: true
                        selfHeal: true
                      syncOptions:
                      - CreateNamespace=true
            EOT,
        ]
      + verify                     = false
      + version                    = "2.0.2"
      + wait                       = true
      + wait_for_jobs              = false
    }

Plan: 1 to add, 0 to change, 0 to destroy.

```
</details>


---
> This comment was generated by [Terraform Pull Request Report Generator](https://github.com/ahmadnassri/action-terraform-report) - action run [`#11509216459`](https://github.com/innovats-hub/system-apps-aks/actions/runs/11509216459) - commit c50c63476b2054cb0c9ccc5f11b6351687a572c9
